In [1]:
import pandas as pd
import requests
import json
from pandas import json_normalize
#import getpass
import numpy as np
from datetime import datetime, timedelta, date
pd.set_option('display.max_rows', 200, 'display.max_columns', 200)

In [2]:
momma = requests.get('https://yomomma-api.herokuapp.com/jokes')
print("Momma:", momma.status_code)

Momma: 200

In [3]:
print(momma.text)

{"joke":"Yo momma is so mean that she has no standard deviation."}

In [4]:
results = momma.json()
results

{'joke': 'Yo momma is so mean that she has no standard deviation.'}

In [5]:
flattened_data = json_normalize(results)
flattened_data

                                                joke
0  Yo momma is so mean that she has no standard d...

In [6]:
# apikey = getpass.getpass()

In [7]:
# app_id = 'cf52f0b5'
# airport = requests.get('https://developer.schiphol.nl/'+app_id+'/'+apikey)
# airport
# Accept: application/json
# app_id: ['cf52f0b5']
# app_key: ['667a631396cca4099daa57016334d02d']
# ResourceVersion: v4

In [8]:
x_change_05_02 = requests.get('https://cdn.jsdelivr.net/gh/fawazahmed0/currency-api@1/2022-05-02/currencies/eur.json')
print("x_change_05_02:", x_change_05_02.status_code)

x_change_05_02: 200

In [29]:
#print(x_change_05_02.text)

In [10]:
# results = api.json()
# results
x_change_05_02 = pd.DataFrame(x_change_05_02.json())
x_change_05_02
#dict(api['date'])

             date          eur
1inch  2022-05-02     0.902024
ada    2022-05-02     1.340896
aed    2022-05-02     3.864652
afn    2022-05-02    90.727549
algo   2022-05-02     1.754733
...           ...          ...
yer    2022-05-02   263.358257
zar    2022-05-02    16.673366
zmk    2022-05-02  9470.609046
zmw    2022-05-02    17.971807
zwl    2022-05-02   338.791808

[208 rows x 2 columns]

In [11]:
x_change_05_02.reset_index(drop=False,inplace=True)
x_change_05_02

     index        date          eur
0    1inch  2022-05-02     0.902024
1      ada  2022-05-02     1.340896
2      aed  2022-05-02     3.864652
3      afn  2022-05-02    90.727549
4     algo  2022-05-02     1.754733
..     ...         ...          ...
203    yer  2022-05-02   263.358257
204    zar  2022-05-02    16.673366
205    zmk  2022-05-02  9470.609046
206    zmw  2022-05-02    17.971807
207    zwl  2022-05-02   338.791808

[208 rows x 3 columns]

In [12]:
#api.reset_index(drop=True)
x_change_05_02.rename(columns={'index':'currency'},inplace=True)
x_change_05_02 = x_change_05_02[['date','currency','eur']]
#data = data[["userId","id","title","completed"]]
display(x_change_05_02.head())
display(x_change_05_02.tail())

         date currency        eur
0  2022-05-02    1inch   0.902024
1  2022-05-02      ada   1.340896
2  2022-05-02      aed   3.864652
3  2022-05-02      afn  90.727549
4  2022-05-02     algo   1.754733

           date currency          eur
203  2022-05-02      yer   263.358257
204  2022-05-02      zar    16.673366
205  2022-05-02      zmk  9470.609046
206  2022-05-02      zmw    17.971807
207  2022-05-02      zwl   338.791808

### Grabbing multiple sources

In [13]:
x_change_05_03 = requests.get('https://cdn.jsdelivr.net/gh/fawazahmed0/currency-api@1/2022-05-03/currencies/eur.json')
print('x_change_05_03:', x_change_05_03.status_code)
x_change_05_02 = requests.get('https://cdn.jsdelivr.net/gh/fawazahmed0/currency-api@1/2022-05-02/currencies/eur.json')
print('x_change_05_02:', x_change_05_02.status_code)
x_change_04_30 = requests.get('https://cdn.jsdelivr.net/gh/fawazahmed0/currency-api@1/2022-04-30/currencies/eur.json')
print('x_change_04_30:', x_change_04_30.status_code)
x_change_04_29 = requests.get('https://cdn.jsdelivr.net/gh/fawazahmed0/currency-api@1/2022-04-29/currencies/eur.json')
print('x_change_04_29:', x_change_04_29.status_code)
x_change_04_28 = requests.get('https://cdn.jsdelivr.net/gh/fawazahmed0/currency-api@1/2022-04-28/currencies/eur.json')
print('x_change_04_28:', x_change_04_28.status_code)

x_change_05_03: 200
x_change_05_02: 200
x_change_04_30: 200
x_change_04_29: 200
x_change_04_28: 200

In [14]:
def data_frame(df):
    df = pd.DataFrame(df.json())
    df.reset_index(drop=False,inplace=True)
    df.rename(columns={'index':'currency'},inplace=True)
    df = df[['date','currency','eur']]
    return df

In [15]:
x_change_05_03 = data_frame(x_change_05_03)
x_change_05_02 = data_frame(x_change_05_02)
x_change_04_30 = data_frame(x_change_04_30)
x_change_04_29 = data_frame(x_change_04_29)
x_change_04_28 = data_frame(x_change_04_28)

In [16]:
display(x_change_05_03.head())
display(x_change_05_03.tail())

         date currency        eur
0  2022-05-03    1inch   0.891752
1  2022-05-03      ada   1.336271
2  2022-05-03      aed   3.863191
3  2022-05-03      afn  90.408653
4  2022-05-03     algo   1.634366

           date currency          eur
203  2022-05-03      yer   263.200552
204  2022-05-03      zar    16.921606
205  2022-05-03      zmk  9467.021280
206  2022-05-03      zmw    17.915654
207  2022-05-03      zwl   338.663501

In [17]:
display(x_change_05_02.head())
display(x_change_05_02.tail())

         date currency        eur
0  2022-05-02    1inch   0.902024
1  2022-05-02      ada   1.340896
2  2022-05-02      aed   3.864652
3  2022-05-02      afn  90.727549
4  2022-05-02     algo   1.754733

           date currency          eur
203  2022-05-02      yer   263.358257
204  2022-05-02      zar    16.673366
205  2022-05-02      zmk  9470.609046
206  2022-05-02      zmw    17.971807
207  2022-05-02      zwl   338.791808

In [18]:
display(x_change_04_28.head())
display(x_change_04_28.tail())

         date currency        eur
0  2022-04-28    1inch   0.799898
1  2022-04-28      ada   1.251455
2  2022-04-28      aed   3.874412
3  2022-04-28      afn  91.242000
4  2022-04-28     algo   1.578855

           date currency          eur
203  2022-04-28      yer   263.965605
204  2022-04-28      zar    16.759227
205  2022-04-28      zmk  9494.533200
206  2022-04-28      zmw    17.972557
207  2022-04-28      zwl   339.647739

In [19]:
x_change = pd.concat([x_change_04_28,x_change_04_29,x_change_04_30, x_change_05_02,x_change_05_03], axis=0)
x_change

           date currency          eur
0    2022-04-28    1inch     0.799898
1    2022-04-28      ada     1.251455
2    2022-04-28      aed     3.874412
3    2022-04-28      afn    91.242000
4    2022-04-28     algo     1.578855
..          ...      ...          ...
203  2022-05-03      yer   263.200552
204  2022-05-03      zar    16.921606
205  2022-05-03      zmk  9467.021280
206  2022-05-03      zmw    17.915654
207  2022-05-03      zwl   338.663501

[1040 rows x 3 columns]

### Looking into a way to create a string for the date in the url

In [20]:
datetime.today().strftime('%Y-%m-%d')

'2022-05-03'

In [21]:
today = datetime. today()
yesterday = today - timedelta(days=1)
one_week_ago = today - timedelta(days=7)
thirty_days_ago = today - timedelta(days=30)
yesterday.strftime('%Y-%m-%d')

'2022-05-02'

In [22]:
date = datetime.today().strftime('%Y-%m-%d')
yesterday = datetime.strptime(date,'%Y-%m-%d') - timedelta(days=7) - timedelta(days=1)
yesterday

datetime.datetime(2022, 4, 25, 0, 0)

In [23]:
# one_week_ago = today - timedelta(days=7)
# start_date = datetime.strptime(date,'%Y-%m-%d')
# end_date = datetime.strptime(one_week_ago,'%Y-%m-%d')
# delta = datetime.timedelta(days=1)
# while start_date <= end_date:
#     print(start_date)
#     start_date += delta

In [24]:
display(datetime.strptime(date,'%Y-%m-%d') - timedelta(days=7))
display(datetime.strptime(date,'%Y-%m-%d'))

datetime.datetime(2022, 4, 26, 0, 0)

datetime.datetime(2022, 5, 3, 0, 0)

In [25]:
iterations = range(1, 5, 1)
[i for i in iterations]

[1, 2, 3, 4]

In [26]:
# Trying to create a list of variable dates based on today's date to capture the latest 5 days of currency data
# start_date = datetime.strptime(date,'%Y-%m-%d')
# end_date = datetime.strptime(date,'%Y-%m-%d') - timedelta(days=7)
# delta = timedelta(days=1)

# while start_date <= end_date:
#     print(start_date)
#     start_date += delta

In [27]:
# Not quite what I wanted. Struggling to save each request.get in it's own right
from random import randint
from time import sleep
dates = ['2022-05-03','2022-05-02','2022-04-30','2022-04-29','2022-04-28']
pages = []

for i in dates:
    # assemble the url:
    start_at= str(i)
    url = 'https://cdn.jsdelivr.net/gh/fawazahmed0/currency-api@1/'+ start_at +'/currencies/eur.json'

    # download html with a get request:
    start_at = requests.get(url, headers = {"Accept-Language": "en-US"})

    # monitor the process by printing the status code
    print("Status code: " + str(start_at.status_code))

    # store response into "pages" list
    pages.append(start_at)

    # respectful nap:
    wait_time = randint(1,4)
    print("I will sleep for " + str(wait_time) + " second/s.")
    sleep(wait_time)

Status code: 200
I will sleep for 1 second/s.
Status code: 200
I will sleep for 3 second/s.
Status code: 200
I will sleep for 2 second/s.
Status code: 200
I will sleep for 2 second/s.
Status code: 200
I will sleep for 4 second/s.

In [28]:
start_at